In [1]:
import pandas as pd
my_lis = [1,2,3,4]

C:\Users\AJANTHA\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\AJANTHA\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
pd.Series(data=my_lis)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
my_tu = ('a','b','c','d')

In [4]:
pd.Series(data = my_tu)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
pd.Series(data = my_lis, index  =my_tu)

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
S1 = pd.Series(data = my_lis, index  =my_tu)

In [7]:
S1['a']

1

In [8]:
S1['c']

3

In [9]:
dic = {' ':'apple', '_':"banana", '#':'cat'}
dic

{' ': 'apple', '_': 'banana', '#': 'cat'}

In [10]:
dic[" "]

'apple'

In [11]:
dic_1 = {'a':'apple', 'b':"banana", 'c':'cat'}
s1 = pd.Series(dic_1)
s1

a     apple
b    banana
c       cat
dtype: object

In [12]:
S1 = pd.Series([1,2,3,4], index = ['USA', 'GER','UAE','IND'])
S1

USA    1
GER    2
UAE    3
IND    4
dtype: int64

In [13]:
S2 = pd.Series([1,5,3,4], index = ['USA', 'UK','UAE','IND'])
S2

USA    1
UK     5
UAE    3
IND    4
dtype: int64

In [14]:
S1+S2

GER    NaN
IND    8.0
UAE    6.0
UK     NaN
USA    2.0
dtype: float64

In [15]:
S1+S1

USA    2
GER    4
UAE    6
IND    8
dtype: int64

In [16]:
import numpy as np
from numpy.random import randn

In [17]:
np.random.seed(101)
df1 = pd.DataFrame(data = randn(5,4), index = ['A','B','C','D','E'], 
                   columns = ['W','X','Y','Z'])
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df1['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [19]:
type(df1['Y'])

pandas.core.series.Series

In [20]:
df1[['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057
E  1.978757  0.683509

In [21]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
#df1['New'] = [1,2,3,4,5]
df1['New'] = df1['X']+df1['Y']
df1

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [23]:
df1.drop("New", axis = 1)# axis = 0 => row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df1

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [25]:
df1.drop("New", axis = 1, inplace = True)

In [26]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df1.drop("B", axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df1.drop("B", axis = 0, inplace = True)
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df1.loc['D'] # label based

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [32]:
df1.iloc[3] # index based

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [33]:
df1.loc[['A','D']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [34]:
df1.loc[['A','C'],['X','Z']]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001

In [35]:
np.random.seed(101)
df2 = pd.DataFrame(data = randn(5,4), index = ['A','B','C','D','E'], 
                   columns = ['W','X','Y','Z'])
df2

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df2>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [37]:
df2[df2>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df2[df2['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df2

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df2.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [41]:
df2['new'] = ['AA','BB','CC','DD','EE']

In [42]:
df2

          W         X         Y         Z new
A  2.706850  0.628133  0.907969  0.503826  AA
B  0.651118 -0.319318 -0.848077  0.605965  BB
C -2.018168  0.740122  0.528813 -0.589001  CC
D  0.188695 -0.758872 -0.933237  0.955057  DD
E  0.190794  1.978757  2.605967  0.683509  EE

In [43]:
df2.set_index('new')

            W         X         Y         Z
new
AA   2.706850  0.628133  0.907969  0.503826
BB   0.651118 -0.319318 -0.848077  0.605965
CC  -2.018168  0.740122  0.528813 -0.589001
DD   0.188695 -0.758872 -0.933237  0.955057
EE   0.190794  1.978757  2.605967  0.683509